Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# ErrorResource_ErrDateExpected_HowToFix_1
source: Edit your formula so that it evaluates to a date at this point in the formula.
bg_bg: Редактирайте формулата си така, че изчислението да води до дата на този етап във формулата.
ca_es: Editeu la fórmula de manera que s'utilitzi una data en aquest punt.
cs_cz: Upravte svůj vzorec tak, aby se v této části vzorce vyhodnotil jako datum.
da_dk: Rediger formlen, så den evalueres til en dato på dette sted i formlen.
de_de: Bearbeiten Sie Ihre Formel so, dass an dieser Stelle der Formel eine Auswertung als Datum erfolgt.
el_gr: Επεξεργαστείτε τον τύπο έτσι ώστε να αποδίδει μια ημερομηνία σε αυτό το σημείο στον τύπο.
es_es: Edite la fórmula para que se calcule como una fecha en este punto de la fórmula.
et_ee: Redigeerige oma valemit nii, et see annab siinkohal valemis tulemuseks kuupäeva.
eu_es: Editatu formula data bat kalkula dezan formularen puntu honetan.
fi_fi: Muokkaa kaavaasi niin, että se antaa arvioitaessa päivämäärän kaavan tässä kohdassa.
fr_fr: Modifiez votre formule afin qu’elle donne une date à ce point de la formule.
gl_es: Editar a fórmula de xeito que se avalíe como unha data neste punto da fórmula.
hi_in: अपने सूत्र को संपादित करें ताकि सूत्र में इस बिंदु पर यह किसी दिनांक के लिए मूल्यांकन करे.
hr_hr: Uredite formulu tako da se na ovom mjestu u formuli nalazi datum.
hu_hu: Módosítsa a képletet úgy, hogy a képlet ezen pontján dátumot adjon vissza.
it_it: Modificare la formula affinché restituisca una data a questo punto della formula.
ja_jp: 数式を編集し、この時点の数式で日付に評価されるようにします。
kk_kz: Формуланы формуладағы осы жерде ол күн болатын етіп өңдеңіз.
ko_kr: 수식의 이 지점에서 날짜로 평가되도록 수식을 편집합니다.
lt_lt: Redaguokite savo formulę taip, kad šios formulės vietos rezultatas būtų data.
lv_lv: Rediģējiet formulu tā, lai šajā formulas posmā tiktu iegūts datums.
ms_my: Edit formula anda supaya menilai tarikh pada peringkat ini dalam formula.
nb_no: Rediger formelen slik at den returnerer en dato på dette punktet i formelen.
nl_nl: Bewerk de formule zodat de formule op deze positie resulteert in een datum.
pl_pl: Edytuj formułę tak, aby jej wynikiem w tym miejscu w formule była data.
pt_br: Edite sua fórmula para que ela avalie uma data neste ponto.
pt_pt: Edite a fórmula para que avalie com uma data nesta parte da fórmula.
ro_ro: Editați-vă formula astfel încât să se evalueze la o dată în acest punct din formulă.
ru_ru: Измените формулу так, чтобы результатом вычисления в этом месте в формуле была дата.
sk_sk: Upravte vzorec tak, aby sa v tomto bode vyhodnotil ako dátum.
sl_si: Uredite formulo tako, da bo ovrednotena kot datum na tem mestu v formuli.
sr_cyrl_rs: Уредите формулу тако да даје датум као резултат у овом делу формуле.
sr_latn_rs: Uredite formulu tako da daje datum kao rezultat u ovom delu formule.
sv_se: Redigera din formel så att den utvärderas till ett datum vid denna tidpunkt i formeln.
th_th: แก้ไขสูตรของคุณเพื่อให้ประเมินเป็นวันที่ที่จุดนี้ในสูตร
tr_tr: Formülünüzü formülün bu noktasında bir tarih verecek şekilde düzenleyin.
uk_ua: Відредагуйте формулу, щоб у цьому місці результат її обчислення становив дату.
vi_vn: Chỉnh sửa công thức của bạn để cho ra kết quả ngày tại điểm này trong công thức.
zh_cn: 编辑公式，使公式此时的计算结果为日期。
zh_tw: 請編輯您的公式，使公式中的此位置能被評估為日期。

# ErrorResource_ErrDateExpected_Link_1
source: Article: Formula reference for Power Apps
bg_bg: Статия: Справка за формули за Power Apps
ca_es: Article: Referència de fórmules del Power Apps
cs_cz: Článek: Referenční informace ke vzorcům v Power Apps
da_dk: Artikel: formelreference til Power Apps
de_de: Artikel: Formelreferenz für Power Apps
el_gr: Άρθρο: Αναφορά τύπου για το Power Apps
es_es: Artículo: Referencia de fórmulas para Power Apps
et_ee: Artikkel: Power Appsi valemiviide
eu_es: Artikulua: Power Apps-erako formula-erreferentzia
fi_fi: Artikkeli: Power Appsin kaavojen viiteopas
fr_fr: Article : Référence de formule pour Power Apps
gl_es: Artigo: Referencia de fórmulas para Power Apps
hi_in: आलेख: Power Apps के लिए सूत्र संदर्भ
hr_hr: Članak: referenca formule za Power Apps
hu_hu: Cikk: Power Apps-képletreferencia
it_it: Articolo: Informazioni di riferimento sulle formule in Power Apps
ja_jp: 記事: Power Apps の数式のリファレンス
kk_kz: Мақала. Power Apps үшін формула сілтемесі
ko_kr: 문서: Power Apps에 대한 수식 참조
lt_lt: Straipsnis: formulės nuoroda, skirta „Power Apps“
lv_lv: Raksts: Formula reference for Power Apps (Formulas atsauce pakalpojumam Power Apps)
ms_my: Artikel: Rujukan formula untuk Power Apps
nb_no: Artikkel: Formelreferanse for Power Apps
nl_nl: Artikel: Formuleverwijzing voor Power Apps
pl_pl: Artykuł: Odwołanie do formuły dla usługi Power Apps
pt_br: Artigo: Referência de fórmula para o Power Apps
pt_pt: Artigo: referência de fórmula para o Power Apps
ro_ro: Articol: referință privind formulele pentru Power Apps
ru_ru: Статья: ссылка на формулу для Power Apps
sk_sk: Článok: Referenčné informácie pre vzorce v službe Power Apps
sl_si: Članek: sklic na formulo za Power Apps
sr_cyrl_rs: Чланак: Референце формула за Power Apps
sr_latn_rs: Članak: Reference formula za Power Apps
sv_se: Artikel: formelreferens för Power Apps
th_th: บทความ: การอ้างอิงสูตรสำหรับ Power Apps
tr_tr: Makale: Power Apps için formül başvurusu
uk_ua: Стаття: "Посилання на формулу в Power Apps"
vi_vn: Bài viết: Tham chiếu công thức cho Power Apps
zh_cn: 文章: 针对 Power Apps 的公式引用
zh_tw: 文章: Power Apps 的公式參考

# ErrorResource_SuggestRemoteExecutionHint_ShortMessage
source: Delegation warning. The "{0}" part of this formula might not work correctly on large data sets.
bg_bg: Предупреждение за делегиране. Частта „{0}“ от тази формула може да не работи правилно при големи набори от данни.
ca_es: Avís de delegació. És possible que la part "{0}" d'aquesta fórmula no funcioni correctament en conjunts grans de dades.
cs_cz: Upozornění delegování. Část {0} tohoto vzorce nemusí fungovat správně pro velké datové sady.
da_dk: Delegeringsadvarsel. Delen "{0}" i denne formel fungerer måske ikke korrekt på store datasæt.
de_de: Warnung zur Delegierung. Der Teil "{0}" dieser Formel funktioniert für große Datasets möglicherweise nicht ordnungsgemäß.
el_gr: Προειδοποίηση ανάθεσης. Το μέρος "{0}" αυτού του τύπου ενδέχεται να μην λειτουργεί σωστά σε μεγάλα σύνολα δεδομένων.
es_es: Advertencia de delegación. Es posible que la parte "{0}" de esta fórmula no funcione correctamente en conjuntos de datos de gran tamaño.
et_ee: Delegeerimise hoiatus. Valemi osa „{0}” ei pruugi suurte andmehulkade puhul õigesti töötada.
eu_es: Ordezkaritzari buruzko abisua. Baliteke formulako "{0}" zatiak ez funtzionatzea datu multzo handietan.
fi_fi: Delegointivaroitus. Tämän kaavan osa {0} ei välttämättä toimi oikein suurille tietojoukoille.
fr_fr: Avertissement relatif à la délégation. La partie « {0} » de cette formule peut ne pas fonctionner correctement sur des jeux de données volumineux.
gl_es: Aviso de delegación. É posible que a parte "{0}" desta fórmula non funcione correctamente en conxuntos de datos grandes.
hi_in: प्रत्यायोजन चेतावनी. हो सकता है कि इस सूत्र का "{0}" भाग बड़े डेटा सेट पर ठीक से काम नहीं करे.
hr_hr: Upozorenje o delegiranju. Dio "{0}" formule možda neće ispravno funkcionirati za velike skupove podataka.
hu_hu: Delegálással kapcsolatos figyelmeztetés. Előfordulhat, hogy a képlet következő része nagy méretű adathalmazok esetében nem fog megfelelően működni: {0}.
it_it: Avviso di delega. La parte "{0}" di questa formula potrebbe non funzionare correttamente su set di dati di grandi dimensioni.
ja_jp: 委任に関する警告です。この数式の "{0}" の部分は、大きなデータ セットで正常に機能しない可能性があります。
kk_kz: Өкілеттік беру туралы ескерту. Бұл формуланың "{0}" бөлігі үлкен деректер жиынтықтарында дұрыс жұмыс істемеуі мүмкін.
ko_kr: 위임 경고입니다. 대규모 데이터 세트에서는 이 수식의 "{0}" 부분이 제대로 작동하지 않을 수 있습니다.
lt_lt: Perdavimo įspėjimas. „{0}“ šios formulės dalis gali tinkamai neveikti, jei duomenų rinkiniai yra dideli.
lv_lv: Brīdinājums par deleģēšanu. Šīs formulas daļa “{0}” lielās datu kopās var darboties nepareizi.
ms_my: Amaran penugasan. Bahagian "{0}" bagi formula ini mungkin tidak berfungsi dengan betul pada set data yang besar.
nb_no: Delegeringsvarsel. Formelens {0}-del kan ha problemer med å fungere på riktig måte på store datasett.
nl_nl: Overdrachtswaarschuwing. Het deel {0} van deze formule werkt mogelijk niet correct bij grote gegevenssets.
pl_pl: Ostrzeżenie dotyczące delegowania. Część „{0}” tej formuły może nie działać poprawnie w przypadku dużych zestawów danych.
pt_br: Aviso de delegação. A parte "{0}" desta fórmula pode não funcionar corretamente em grandes conjuntos de dados.
pt_pt: Aviso de delegação. A parte "{0}" desta fórmula poderá não funcionar corretamente em grandes conjuntos de dados.
ro_ro: Avertisment referitor la delegare. Partea „{0}” din această formulă ar putea să nu funcționeze corect pe seturi mari de date.
ru_ru: Предупреждение о делегировании. Часть "{0}" этой формулы может неверно работать с большими наборами данных.
sk_sk: Upozornenie delegovania. Časť {0} tohto vzorca nemusí na veľkých množinách údajov fungovať správne.
sl_si: Opozorilo o pooblastitvi. Del »{0}« te formula morda ne bo deloval pravilno v velikih naborih podatkov.
sr_cyrl_rs: Упозорење о делегирању. Део „{0}“ ове формуле можда неће исправно функционисати на великим скуповима података.
sr_latn_rs: Upozorenje o delegiranju. Deo „{0}“ ove formule možda neće ispravno funkcionisati na velikim skupovima podataka.
sv_se: Delegeringsvarning. Delen {0} av den här formeln kanske inte fungerar korrekt på stora datauppsättningar.
th_th: คำเตือนเกี่ยวกับการรับมอบสิทธิ์ ส่วน "{0}" ของสูตรนี้อาจทำงานไม่ถูกต้องในชุดข้อมูลขนาดใหญ่
tr_tr: Temsilci uyarısı. Bu formülün "{0}" bölümü, büyük veri kümelerinde düzgün çalışmayabilir.
uk_ua: Попередження про делегування. Частина "{0}" цієї формули може неправильно працювати з великими наборами даних.
vi_vn: Cảnh báo về ủy quyền. Phần "{0}" trong công thức này có thể không hoạt động đúng cách trên tập hợp dữ liệu lớn.
zh_cn: 委派警告。此公式的“{0}”部分可能在大型数据集上无法正常工作。
zh_tw: 委派警告。此公式的 "{0}" 部分可能無法在大型資料集上正確運作。

# ErrorResource_SuggestRemoteExecutionHint_LongMessage
source: The data source might not be able to process the formula and might return an incomplete data set. Your application might not return correct results or behave correctly if the data set is incomplete.
bg_bg: Възможно е източникът на данни да не може да обработи формулата и може да върне непълен набор от данни. Вашето приложение може да не върне правилни резултати или поведението му може да е неправилно, ако наборът от данни е непълен.
ca_es: És possible que la font de dades no pugui processar la fórmula i retorni un conjunt de dades incomplet. Així mateix, és possible que l'aplicació no retorni resultats correctes o que es comporti incorrectament si el conjunt de dades està incomplet.
cs_cz: Zdroj dat nemusí být schopný zpracovat vzorec a může vrátit neúplnou datovou sadu. Pokud bude datová sada neúplná, aplikace nemusí vrátit správné výsledky nebo se nemusí chovat správně.
da_dk: Datakilden kan måske ikke behandle formlen og vil måske returnere et ufuldstændigt datasæt. Programmet kan måske ikke returnere korrekte resultater eller fungere korrekt, hvis datasættet er ufuldstændigt.
de_de: Die Datenquelle kann die Formel möglicherweise nicht verarbeiten und könnte ein unvollständiges Dataset zurückgeben. Ihre Anwendung liefert eventuell keine korrekten Ergebnisse oder verhält sich nicht ordnungsgemäß, wenn das Dataset unvollständig ist.
el_gr: Η επεξεργασία του τύπου μπορεί να μην είναι δυνατή από την προέλευση δεδομένων και μπορεί να επιστραφεί ελλιπές σύνολο δεδομένων. Η εφαρμογή σας μπορεί να μην επιστρέψει σωστά αποτελέσματα ή να μην συμπεριφέρεται σωστά, αν το σύνολο δεδομένων είναι ελλιπές.
es_es: Puede que el origen de datos no pueda procesar la fórmula y que devuelva un conjunto de datos incompleto. Es posible que la aplicación no devuelva resultados correctos o que no se comporte correctamente si el conjunto de datos está incompleto.
et_ee: Võib juhtuda, et andmeallikas ei saa valemit töödelda ja võib tagastada pooliku andmehulga. Kui andmehulk on poolik, võib teie rakendus tagastada valed tulemid või käituda valesti.
eu_es: Baliteke datu-iturburuak formula prozesatu ezin izatea eta osorik ez dagoen datu multzo bat itzultzea. Baliteke aplikazioak emaitza zuzenak ez itzultzea edo ez funtzionatzea datu multzoa osorik ez badago.
fi_fi: Tietolähde ei ehkä pysty käsittelemään kaavaa ja saattaa palauttaa epätäydellisen tietojoukon. Sovelluksesi ei ehkä palauta oikeita tuloksia tai käyttäydy oikein, jos tietojoukko on epätäydellinen.
fr_fr: La source de données n'est peut-être pas en mesure de traiter la formule et peut retourner un jeu de données incomplet. Il se peut que votre application ne puisse pas retourner de résultats corrects ni fonctionner correctement si le jeu de données est incomplet.
gl_es: É posible que a orixe de datos non poida procesar a fórmula e que devolva un conxunto de datos incompleto. Pode que a aplicación non devolva resultados correctos ou que funcione de xeito incorrecto se o conxunto de datos está incompleto.
hi_in: हो सकता है कि डेटा स्रोत, सूत्र को संसाधित न कर पाए और कोई अपूर्ण डेटा सेट वापस लौटाए. हो सकता है कि डेटा सेट अपूर्ण होने पर आपका एप्लिकेशन सही परिणाम न लौटा पाए या सही व्यवहार न करे.
hr_hr: Izvor podataka možda neće moći obraditi formulu, pa će vratiti nepotpun skup podataka. Ako skup podataka nije potpun, vaša aplikacija možda neće vratiti točne rezultate ni pravilno funkcionirati.
hu_hu: Előfordulhat, hogy az adatforrás nem tudja feldolgozni a képletet, és hiányos adathalmazt ad vissza. Ha az adathalmaz hiányos, előfordulhat, hogy az alkalmazás helytelen eredményeket ad vissza, vagy nem a várt módon működik.
it_it: L'origine dati potrebbe non essere in grado di elaborare la formula e potrebbe quindi restituire un set di dati incompleto. Se il set di dati è incompleto, l'applicazione potrebbe non restituire i risultati corretti o non comportarsi nel modo previsto.
ja_jp: データ ソースは数式を処理できずに、不完全なデータ セットを返すことがあります。データ セットが不完全な場合、アプリケーションは正しい結果を返さないか、正常に機能しない場合があります。
kk_kz: Деректер көзі формуланы өңдей алмауы мүмкін және толық емес деректер жиынтығын қайтаруы мүмкін. Деректер жиынтығы толық болмаса, бағдарламаңыз дұрыс нәтижелерді қайтармауы немесе дұрыс жұмыс істемеуі мүмкін.
ko_kr: 데이터 원본이 수식을 처리하지 못할 수 있으며 불완전한 데이터 세트를 반환할 수도 있습니다. 데이터 세트가 불완전하면 애플리케이션이 올바른 결과를 반환할 수 없거나 제대로 동작하지 않을 수 있습니다.
lt_lt: Duomenų šaltinis gali nepajėgti apdoroti formulės ir pateikti ne visą duomenų rinkinį. Jei duomenų rinkinys bus ne visas, jūsų programa gali teikti neteisingus rezultatus arba veikti netinkamai.
lv_lv: Datu avots var nespēt apstrādāt formulu un var atgriezt nepilnīgu datu kopu. Ja datu kopa ir nepilnīga, programma var atgriezt nepareizus rezultātus vai darboties nepareizi.
ms_my: Sumber data mungkin tidak dapat memproses formula dan mungkin mengembalikan set data yang tidak lengkap. Aplikasi anda mungkin tidak mengembalikan keputusan yang betul atau berkelakuan dengan betul jika set data tidak lengkap.
nb_no: Det kan hende at datakilden ikke får behandlet formelen og dermed returnerer et ufullstendig datasett. Det kan hende at programmet ikke returnerer riktige resultater eller fungerer som det skal, hvis datasettet er ufullstendig.
nl_nl: Mogelijk kan de gegevensbron de formule niet verwerken en wordt er een onvolledige gegevensset geretourneerd. Uw toepassing kan onjuiste resultaten retourneren of zich onjuist gedragen als de gegevensset niet compleet is.
pl_pl: Źródło danych może nie być w stanie przetworzyć formuły i może zwrócić niekompletny zestaw danych. Twoja aplikacja może nie zwrócić prawidłowych wyników lub zachowywać się nieprawidłowo, jeśli zestaw danych będzie niekompletny.
pt_br: A fonte de dados pode não ser capaz de processar a fórmula e pode retornar um conjunto de dados incompleto. Seu aplicativo poderá não retornar resultados corretos ou não se comportar corretamente se o conjunto de dados estiver incompleto.
pt_pt: A origem de dados poderá não ser capaz de processar a fórmula e poderá devolver um conjunto de dados incompleto. A aplicação poderá não devolver os resultados corretos ou ter um comportamento correto se o conjunto de dados estiver incompleto.
ro_ro: Este posibil ca sursa de date să nu poată procesa formula și să returneze un set de date incomplet. Aplicația ar putea să nu returneze rezultate corecte sau să nu se comporte corect dacă setul de date este incomplet.
ru_ru: Источник данных может не суметь обработать формулу и вернет неполный набор данных. Из-за неполного набора приложение может возвращать неверные результаты или работать некорректно.
sk_sk: Zdroj údajov nemusí byť schopný spracovať vzorec a môže vrátiť neúplnú množinu údajov. Vaša aplikácia nemusí vrátiť správne výsledky alebo sa nemusí správať správne, ak je množina údajov neúplná.
sl_si: Vir podatkov morda ne bo mogel obdelati formule in bo morda vrnil nepopoln nabor podatkov. Če nabor podatkov ni popoln, vaša aplikacija morda ne bo vrnila pravilnih rezultatov ali ne bo delovala pravilno.
sr_cyrl_rs: Извор података можда неће моћи да обради формулу и можда ће вратити непотпун скуп података. Апликација можда неће вратити исправне резултате или се можда неће исправно понашати ако је скуп података непотпун.
sr_latn_rs: Izvor podataka možda neće moći da obradi formulu i možda će vratiti nepotpun skup podataka. Aplikacija možda neće vratiti ispravne rezultate ili se možda neće ispravno ponašati ako je skup podataka nepotpun.
sv_se: Datakällan kanske inte kan bearbeta formeln och kan då returnera en ofullständig datauppsättning. Ditt program kanske inte kan returnera korrekta resultat eller uppvisa korrekt beteende om datauppsättningen är ofullständig.
th_th: แหล่งข้อมูลอาจไม่สามารถประมวลผลสูตรและอาจส่งชุดข้อมูลที่ไม่สมบูรณ์กลับมา แอปพลิเคชันของคุณอาจไม่ส่งผลลัพธ์ที่ถูกต้องกลับมาหรือทำงานได้อย่างถูกต้องหากชุดข้อมูลไม่สมบูรณ์
tr_tr: Veri kaynağı, formülü işleyemeyebilir ve eksik bir veri kümesi döndürebilir. Veri kümesi eksikse uygulamanız doğru sonuçlar döndürmeyebilir veya düzgün çalışmayabilir.
uk_ua: Якщо формулу не вдасться обробити, джерело даних може повернути їх неповний набір, а тому програма не зможе повернути правильні результати або належно працювати.
vi_vn: Nguồn dữ liệu này có thể không xử lý được công thức và có thể trả về một tập hợp dữ liệu không đầy đủ. Ứng dụng của bạn có thể không trả về kết quả đúng hoặc hoạt động đúng cách nếu tập hợp dữ liệu không hoàn chỉnh.
zh_cn: 数据源可能无法处理该公式且可能返回不完整的数据集。如果数据集不完整，应用程序可能不返回正确的结果或行为不正确。
zh_tw: 資料來源可能無法處理此公式，而且可能會傳回不完整的資料集。若資料集不完整，您的應用程式可能無法傳回正確結果，或無法正確運作。
